# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8-cls image classification model. For Usage examples see https://docs.ultralytics.com/tasks/classify

# Parameters
nc: 7 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 1024]
  l: [1.00, 1.00, 1024]
  x: [1.00, 1.25, 1024]

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 1, C2f_RepCSP_1, [256, 128, 64, 1]]
  - [-1, 1, DCMConv, [256]] # 3-P3/8
  - [-1, 1, C2f_RepCSP_2, [512, 256, 128, 1]]
  - [-1, 1, DCMConv, [512]] # 3-P3/8
  - [-1, 1, PSA, [512]]
  - [-1, 1, C2f_RepCSP_2, [1024, 512, 256, 1]]
  - [-1, 1, DCMConv, [1024]] # 3-P3/8
  - [-1, 1, C2f_RepCSP_1, [1024, 512, 256, 1]]
  - [-1, 1, C2PSA, [1024]]

# YOLOv8.0n head
head:
  - [-1, 1, Classify, [nc]] # Classify